<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Encabezados y p&aacute;rrafos</title>
</head>
<body>
<header>
    <a href="index.html" style="padding: 25px">Inicio</a>
    <a href="ejercicio02.html" style="padding: 25px">Ejercicio Anterior</a>
    <a href="ejercicio04.html" style="padding: 25px">Siguiente Ejercicio</a>
</header>
<h1 style="font-size: 8em">DEFINICIONES INFORM&Aacute;TICAS</h1>
<ul style="list-style-type: disc">
    <li><h2>Hardware (<i>La parte a la que puedes golpear</i>)</h2></li>
    <p>El hardware , equipo o soporte f&iacute;sico en inform&aacute;tica se refiere a las partes f&iacute;sicas,
        tangibles, de un sistema inform&aacute;tico, sus componentes el&eacute;ctricos, electr&oacute;nicos,
        electromec&aacute;nicos y mec&aacute;nicos.<br>Los cables, as como los muebles o cajas, los perif&eacute;ricos
        de todo tipo, y cualquier otro elemento f&iacute;sico involucrado, componen el hardware o soporte f&iacute;sico;
        contrariamente, el soporte l&oacute;gico e intangible es el llamado software.
    </p>
    <li><h2>Software (<i>La parte a la que solo puedes insultar</i>)</h2></li>
    <p>Se conoce como software,​ logicial o soporte l&oacute;gico al sistema formal de un sistema inform&aacute;tico,
        que comprende el conjunto de los componentes l&oacute;gicos necesarios que hacen posible la realización de
        tareas espec&iacute;ficas, en contraposici&oacute;n a los componentes f&iacute;sicos que son llamados hardware.
    </p>
    <li><h2>Sistema Operativo</h2></li>
    <p>Un sistema operativo es un conjunto de programas que permite manejar la memoria, disco, medios de almacenamiento
        de informaci&oacute;n y los diferentes perif&eacute;ricos o recursos de nuestra computadora, como son el
        teclado, el rat&oacute;, la impresora, la placa de red, entre otros.
    </p>
    <li><h2>Lenguaje de Programaci&oacute;n</h2></li>
    <p>Un lenguaje de programaci&oacute;n es un lenguaje formal que le proporciona a una persona, en este caso el
        programador, la capacidad de escribir una serie de instrucciones o secuencias de &oacute;rdenes en forma de
        algoritmos con el fin de controlar el comportamiento f&iacute;sico o l&oacute;gico de un sistema
        inform&aacute;tico, de manera que se puedan obtener diversas clases de datos o ejecutar determinadas tareas.
        <br>A todo este conjunto de &oacute;rdenes escritas mediante un lenguaje de programaci&oacute;n se le denomina
        programa inform&aacute;tico.
    </p>
</ul>
</body>
</html>